tutorials/incompressible/pisoFoam/RAS/cavity/system/FOs/FOsurfaceInterpolate
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

surfaceInterpolate1
{
    // Mandatory entries
    type            surfaceInterpolate;
    libs            (fieldFunctionObjects);
    fields          ((U surfaceU) (p surfaceP) (k surfaceK) (divU surfaceDivU));

    // Optional (inherited) entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         1000;
    executeControl  writeTime;
    executeInterval -1;
    writeControl    writeTime;
    writeInterval   -1;
}


// ************************************************************************* //
